for i in 1, 2, 3, 4, 5: # Для каждого числа из набора от 1 до 5...
	print(i ** 2)         # ... выводим его квадрат с новой строчки

for i in range(9): # Каждое число от 0 до 8...
	print(i)         # ... выводится на экран

x = 0
while x < 10: # Пока x < 10
	print(x)    # Выводим x
  x += 3      # Увеличиваем x на 3

'''while условие:
	действия, выполняющиеся при истинности условия (тело цикла)
else:
	действия, если цикл завершился самостоятельно'''

'''for имя переменная in набор данных:
	действия для каждого элемента из набора (тело цикла)
else:
	действия, если цикл завершился самостоятельно'''